{
  "Messages": [
    {
      "Type": 1,
      "Text": "Unity.IL2CPP.Building.BuilderFailedException: Build failed with 0 successful nodes and 0 failed ones\r\nError: Internal build system error. BuildProgram exited with code 1.\nUnity.IL2CPP.Bee.BuildLogic.ToolchainNotFoundException: IL2CPP C\u002B\u002B code builder is unable to build C\u002B\u002B code. In order to build C\u002B\u002B code for UWP, you must have one of these installed:\n * Visual Studio 2022 or newer with C\u002B\u002B compilers and Windows 10 (or newer) SDK (recommended)\n * Visual Studio 2019 with C\u002B\u002B compilers and Windows 10 (or newer) SDK\n * Visual Studio 2017 with C\u002B\u002B compilers and Windows 10 (or newer) SDK\n * Visual Studio 2015 with C\u002B\u002B compilers and Windows 10 (or newer) SDK\n\nVisual Studio 2017 (or newer) is detected using \u0060vswhere.exe\u0060 as well as VSCOMNTOOLS environment variables.\nVisual Studio 2015 is detected by looking at \u0022SOFTWARE\\Microsoft\\VisualStudio\\14.0_Config\\InstallDir\u0022 in the registry as well as VSCOMNTOOLS environment variables.\nWindows 10 (or newer) SDK is detected by looking at \u0022SOFTWARE\\Wow6432Node\\Microsoft\\Microsoft SDKs\\Windows\\v10.0\\InstallationFolder\u0022 in the registry.\n\nUnable to detect any compatible Visual Studio installation!\n * Found Visual Studio 2022 installation without support for architecture arm32\r\n * Found Visual Studio 2019 installation without support for architecture arm32\r\n * Found Visual Studio 2017 installation without support for architecture arm32\r\n\r\n\r\n   at Unity.IL2CPP.Bee.BuildLogic.UniversalWindows.UWPBuildLogic.UserAvailableToolchainFor(Architecture architecture)\r\n   at Unity.IL2CPP.Bee.IL2CPPExeCompileCppBuildProgram.BuildProgram.Main(String[] args, String currentDirectory)\r\n   at Unity.IL2CPP.Building.InProcessBuildProgram.StartImpl(String workingDirectory, String[] arguments)\r\n\r\n\r\n   at il2cpp.Program.DoRun(TinyProfiler2 tinyProfiler, String[] args, RuntimePlatform platform, Il2CppCommandLineArguments il2CppCommandLineArguments, BuildingOptions buildingOptions, Boolean throwExceptions)"
    }
  ],
  "CommandLine": "--compile-cpp --platform=WinRT --incremental-g-c-time-slice=3 --relative-data-path=Data/il2cpp_data --dotnetprofile=unityaot-win32 --profiler-report --print-command-line --architecture=ARMv7 --configuration=Debug --outputpath=C:\\Users\\mikul\\zavrsni-rad\\My-project\\Install\\\\build\\bin\\ARM\\Debug\\GameAssembly.dll --data-folder=C:\\Users\\mikul\\zavrsni-rad\\My-project\\Install\\\\build\\bin\\ARM\\Debug\\ --cachedirectory=C:\\Users\\mikul\\zavrsni-rad\\My-project\\Install\\\\build\\obj\\il2cppOutputProject\\ARM\\Debug\\ --generatedcppdir=C:\\Users\\mikul\\zavrsni-rad\\My-project\\Install\\Il2CppOutputProject\\\\Source --verbose --baselib-directory=C:\\Program Files\\Unity\\Hub\\Editor\\2022.3.27f1\\Editor\\Data\\PlaybackEngines\\MetroSupport\\Players\\UAP\\il2cpp\\ARM\\Debug --profiler-output-file=C:\\Users\\mikul\\zavrsni-rad\\My-project\\Install\\\\build\\obj\\il2cppOutputProject\\ARM\\Debug\\profile.json"
}